In [18]:
import pandas as pd

In [19]:
df = pd.read_csv("outlier.csv", sep = ",") # Csv dosyası zaten virgüllerle ayrıldığı için "sep" olmasa da olurdu şimdilik
df

      isim  boy
0      can   88
1      ali  132
2    tugce  134
3    melis  137
4   ismail  139
5      nur  142
6      ece  142
7      ege  144
8     rana  147
9   berrin  148
10   berre  149
11   hilal  149
12     alp  150
13    veli  207
14   ilker  234

In [20]:
df.describe()

              boy
count   15.000000
mean   149.466667
std     32.943386
min     88.000000
25%    138.000000
50%    144.000000
75%    149.000000
max    234.000000

**Q1 %25 percentile hesaplama**

In [21]:
Q1 = df.boy.quantile(0.25)
Q1 # Küçükten büyüğe sıralı listede median'dan öncekilerin medianı Q1 olur

138.0

**Median hesaplama**

In [22]:
Q2 = df.boy.quantile(0.50)
Q2

144.0

**Q3 %75 percentile hesaplama**

In [23]:
Q3 = df.boy.quantile(0.75)
Q3 # Küçükten büyüğe sıralı listede median'dan sonrakilerin medianı Q3 olur

149.0

In [24]:
IQR_degeri = Q3 - Q1
IQR_degeri

11.0

**Alt limit ve üst limit hesaplama**

In [25]:
alt_limit = Q1 - 1.5*IQR_degeri
alt_limit

121.5

In [26]:
ust_limit = Q3 + 1.5*IQR_degeri
ust_limit

165.5

**Outlier(Aykırı) değer**

In [27]:
df[(df.boy < alt_limit) | (df.boy > ust_limit)] # Aykırı değerler

     isim  boy
0     can   88
13   veli  207
14  ilker  234

In [29]:
df_outlier_filtrelenmis = df[(df.boy > alt_limit) & (df.boy < ust_limit)] # Aykırı değerlerin çıkarılmış hali
df_outlier_filtrelenmis

      isim  boy
1      ali  132
2    tugce  134
3    melis  137
4   ismail  139
5      nur  142
6      ece  142
7      ege  144
8     rana  147
9   berrin  148
10   berre  149
11   hilal  149
12     alp  150